Revit 2026 API
IDockablePaneProvider Interface
 Interface that the Revit UI will call during initialization of the user interface to gather information about add-in dockable pane windows.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public interface IDockablePaneProvider
Public Interface IDockablePaneProvider
public interface class IDockablePaneProvider
type IDockablePaneProvider = interface end
The IDockablePaneProvider type exposes the following members.
Methods
Name | Description
SetupDockablePane |  Method called during initialization of the user interface to gather information about a dockable pane window.
Top
See Also
Reference
Autodesk.Revit.UI Namespace